src/Catalogs/ВариантыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВариантыОплаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОграничениеПериод</Name>
					<Comment>0 - нет, 1 - день, 2 - неделя, 3 - месяц, 4 - заказ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминалСертификата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежнаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОграниченияКатегорий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченийПоСписку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопустимыеКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неплательщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безнал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаФолио</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВариантыОплаты/Forms/ФормаСписка/module.bsl
// Управление доступностью элементов формы
//
Процедура УправлениеДоступностью()
	
	Тип = ЭлементыФормы.СправочникСписок.ТекущиеДанные.Тип;
	
	Если Тип=Перечисления.ТипыОплаты.Нал ИЛИ
		Тип=Перечисления.ТипыОплаты.Неплательщик ИЛИ
		глВерсия>1 И Тип = Перечисления.ТипыОплаты.Бонусы Тогда
		ЭлементыФормы.СправочникСписок.Колонки.НомерВККМ.ТолькоПросмотр = Истина;
	Иначе
		ЭлементыФормы.СправочникСписок.Колонки.НомерВККМ.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// При изменении типа оплаты
//
Процедура СправочникСписокТипПриИзменении(Элемент)
	
	Тип = Элемент.Значение;
	
	Если Тип = Перечисления.ТипыОплаты.Нал Тогда
		ЭлементыФормы.СправочникСписок.ТекущиеДанные.НомерВККМ = 1;
		
	ИначеЕсли Тип = Перечисления.ТипыОплаты.Неплательщик ИЛИ 
		глВерсия>1 И Тип = Перечисления.ТипыОплаты.Бонусы Тогда
		
		ЭлементыФормы.СправочникСписок.ТекущиеДанные.НомерВККМ = 0;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭлементыФормы.СправочникСписок.ТекущиеДанные.Наименование) Тогда
		ЭлементыФормы.СправочникСписок.ТекущиеДанные.Наименование = Строка(Тип);
	КонецЕсли;
	
	УправлениеДоступностью();
	
КонецПроцедуры

// При активизации строки списка
//
Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	УправлениеДоступностью();

КонецПроцедуры

Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ДанныеСтроки.НомерВККМ = 0 Тогда
		ОформлениеСтроки.Ячейки.НомерВККМ.Текст = "не регистрировать";
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
	Если глВерсия=1 Тогда
		ЭлементыФормы.СправочникСписок.Колонки.Скидка.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

СписокНомерВККМ = ЭлементыФормы.СправочникСписок.Колонки.НомерВККМ.ЭлементУправления.СписокВыбора;
СписокНомерВККМ.Добавить(0,"не регистрировать");
СписокНомерВККМ.Добавить(2);
СписокНомерВККМ.Добавить(3);
СписокНомерВККМ.Добавить(4);
